/* eslint-disable no-empty-pattern */
/* eslint-disable react-refresh/only-export-components */
import { Descriptions, DescriptionsProps } from 'antd'
import React from 'react'

interface Props {

}

const RemarkDetail: React.FC<Props> = (props) => {
  const { } = props

  const items: DescriptionsProps['items'] = [
    {
      key: '1',
      label: 'ขออนุญาตให้ยานพาหนะเดินบนทางหลวงชนบท ข้อที่',
      children: <p>6</p>,
    },
    {
      key: '2',
      label: 'เหตุผลที่ขอ',
      children: <p>เหตุผลในการขออนุญาตให้ยานพาหนะเดินบนทางหลวงชนบทตามข้อที่ 6 แห่งประกาศผู้อำนวยการทางหลวงชนบท เป็นไปเพื่อรองรับการใช้งานของยานพาหนะที่มีลักษณะพิเศษในด้านน้ำหนักบรรทุกหรือขนาดมิติของตัวรถ ซึ่งเกินกว่ากำหนดตามกฎหมาย แต่มีความจำเป็นต้องใช้ในภารกิจเฉพาะด้าน เช่น การขนย้ายเครื่องจักรกลขนาดใหญ่ วัสดุก่อสร้าง หรืออุปกรณ์สำหรับโครงการพัฒนาโครงสร้างพื้นฐาน การก่อสร้างระบบสาธารณูปโภค หรือการส่งมอบสินค้าอุตสาหกรรมที่ไม่สามารถแยกชิ้นได้โดยพื้นที่ปลายทางหรือเส้นทางที่ใช้มักอยู่ในแนวทางหลวงชนบทที่ไม่มีเส้นทางอื่นทดแทนที่สามารถรองรับลักษณะรถดังกล่าวได้อย่างเหมาะสมและปลอดภัย ทั้งนี้การยื่นคำขออนุญาตเพื่อให้สามารถใช้ทางหลวงชนบทได้อย่างถูกต้องตามข้อกำหนดของกฎหมาย จะช่วยให้หน่วยงานเจ้าของทางสามารถควบคุม กำกับ และบริหารความเสี่ยงที่อาจเกิดขึ้นกับสภาพทาง เช่น ความเสียหายของผิวจราจร ความมั่นคงของโครงสร้างสะพาน และความปลอดภัยของผู้ใช้ทางร่วมอื่น ๆ ได้อย่างมีประสิทธิภาพรวมถึงเปิดโอกาสให้มีการกำหนดเงื่อนไขหรือมาตรการเพิ่มเติม เช่น การจำกัดช่วงเวลาเดินรถ การจัดทำหนังสือรับรองน้ำหนัก หรือการติดตามผลกระทบจากการใช้เส้นทางภายหลังการอนุญาต ทั้งหมดนี้เพื่อให้การใช้งานเป็นไปโดยสมดุลระหว่างความจำเป็นของผู้ขอใช้ทางและความมั่นคงของโครงสร้างพื้นฐานของประเทศในระยะยาว</p>,
    },
  ]

  return (
    <Descriptions
      title="เหตุผล"
      items={items}
      column={1}
    />
  )
}

export default React.memo<Props>(RemarkDetail)
